// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   TelnetMgmtStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell telnetmgmt command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_TELNETMGMT_LOCATE_PROTOCOL #language eng  "TelnetMgmt: Locate TelnetServer Protocol error - %r\n"

#string STR_TELNETMGMT_SETOPTION       #language eng  "TelnetMgmt: SetOption error - %r\n"

#string STR_TELNETMGMT_ANSI_TYPE       #language eng  "Terminal Type: PcAnsiType\n"

#string STR_TELNETMGMT_VT100_TYPE      #language eng  "Terminal Type: VT100Type\n"

#string STR_TELNETMGMT_VT100PLUS_TYPE  #language eng  "Terminal Type: VT100PlusType\n"

#string STR_TELNETMGMT_VTUTF8_TYPE     #language eng  "Terminal Type: VTUTF8Type\n"

#string STR_TELNETMGMT_UNKNOWN_TYPE    #language eng  "Terminal Type: Unknown Type\n"

#string STR_TELNETMGMT_TELNET_SERVER   #language eng  "EFI Telnet Server Manager\n"

#string STR_TELNETMGMT_COPYRIGHT       #language eng  "Copyright (c) Intel Corporation 2002\n"

#string STR_TELNETMGMT_VERSION         #language eng  "Version: v0.03 ww23.1\n"

#string STR_TELNETMGMT_USAGE           #language eng  "Usage: TelnetMgmt\n"

#string STR_TELNETMGMT_TERMINALTYPE    #language eng  "   or: TelnetMgmt [-t TerminalType]\n"

#string STR_TELNETMGMT_SWITCHES_ARGUMENTS #language eng  "\n<Switches & Arguments>:\n"

#string STR_TELNETMGMT_CHANCE_TERMINAL #language eng  " -t           : Change Terminal Type\n"

#string STR_TELNETMGMT_STRING_TO_IDENTIFY #language eng  " TerminalType : String to identify Terminal Type\n"

#string STR_TELNETMGMT_PCANSI          #language eng  "                PcAnsi    - PcAnsi Type\n"

#string STR_TELNETMGMT_VT100           #language eng  "                VT100     - vt100 Type\n"

#string STR_TELNETMGMT_VT100PLUS       #language eng  "                VT100plus - VT100 plus Type\n"

#string STR_TELNETMGMT_VTUTF8          #language eng  "                VTUTF8    - VTUTF8 Type\n"

#string STR_TELNETMGMT_NOTE            #language eng  "\nNote:\n"

#string STR_TELNETMGMT_KNOWN_BUGS      #language eng  "\nKnown Bugs:\n"

#string STR_HELPINFO_TELNETMGMT_LINEHELP   #language eng  "TELNETMGMT [-t <TerminalType>]"

#string STR_HELPINFO_TELNETMGMT_VERBOSEHELP #language eng  "Change terminal type\n"
                                                           "\n"
                                                           "TELNETMGMT [-t <TerminalType>]\n"
                                                           "\n"
                                                           "     -t      - Specifies the terminal type\n"
                                                           "               Available types:\n"
                                                           "                 0           - PcAnsi type\n"
                                                           "                 1           - vt100 type\n"
                                                           "                 2           - vt100 plus type\n"
                                                           "                 3           - VTUTF8 type\n"
